Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/component/fcw.h
#define FCW_INTENSET_DONE_Pos                 _UINT32_(0)                                          /* (FCW_INTENSET) NVM Operation Done Interrupt Enable Bit Position */
#define FCW_INTENSET_DONE_Msk                 (_UINT32_(0x1) << FCW_INTENSET_DONE_Pos)             /* (FCW_INTENSET) NVM Operation Done Interrupt Enable Bit Mask */
#define FCW_INTENSET_DONE(value)              (FCW_INTENSET_DONE_Msk & (_UINT32_(value) << FCW_INTENSET_DONE_Pos)) /* Assigment of value for DONE in the FCW_INTENSET register */
#define FCW_INTENSET_KEYERR_Pos               _UINT32_(1)                                          /* (FCW_INTENSET) Key Error Interrupt Enable Bit Position */
#define FCW_INTENSET_KEYERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_KEYERR_Pos)           /* (FCW_INTENSET) Key Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_KEYERR(value)            (FCW_INTENSET_KEYERR_Msk & (_UINT32_(value) << FCW_INTENSET_KEYERR_Pos)) /* Assigment of value for KEYERR in the FCW_INTENSET register */
#define FCW_INTENSET_CFGERR_Pos               _UINT32_(2)                                          /* (FCW_INTENSET) Configuration Error Interrupt Enable Bit Position */
#define FCW_INTENSET_CFGERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_CFGERR_Pos)           /* (FCW_INTENSET) Configuration Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_CFGERR(value)            (FCW_INTENSET_CFGERR_Msk & (_UINT32_(value) << FCW_INTENSET_CFGERR_Pos)) /* Assigment of value for CFGERR in the FCW_INTENSET register */
#define FCW_INTENSET_FIFOERR_Pos              _UINT32_(3)                                          /* (FCW_INTENSET) FIFO Underrun during Row Write Interrupt Enable Bit Position */
#define FCW_INTENSET_FIFOERR_Msk              (_UINT32_(0x1) << FCW_INTENSET_FIFOERR_Pos)          /* (FCW_INTENSET) FIFO Underrun during Row Write Interrupt Enable Bit Mask */
#define FCW_INTENSET_FIFOERR(value)           (FCW_INTENSET_FIFOERR_Msk & (_UINT32_(value) << FCW_INTENSET_FIFOERR_Pos)) /* Assigment of value for FIFOERR in the FCW_INTENSET register */
#define FCW_INTENSET_BUSERR_Pos               _UINT32_(4)                                          /* (FCW_INTENSET) AHB Bus Error during Row Write Interrupt Enable Bit Position */
#define FCW_INTENSET_BUSERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_BUSERR_Pos)           /* (FCW_INTENSET) AHB Bus Error during Row Write Interrupt Enable Bit Mask */
#define FCW_INTENSET_BUSERR(value)            (FCW_INTENSET_BUSERR_Msk & (_UINT32_(value) << FCW_INTENSET_BUSERR_Pos)) /* Assigment of value for BUSERR in the FCW_INTENSET register */
#define FCW_INTENSET_WPERR_Pos                _UINT32_(5)                                          /* (FCW_INTENSET) Write Protection Error Interrupt Enable Bit Position */
#define FCW_INTENSET_WPERR_Msk                (_UINT32_(0x1) << FCW_INTENSET_WPERR_Pos)            /* (FCW_INTENSET) Write Protection Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_WPERR(value)             (FCW_INTENSET_WPERR_Msk & (_UINT32_(value) << FCW_INTENSET_WPERR_Pos)) /* Assigment of value for WPERR in the FCW_INTENSET register */
#define FCW_INTENSET_OPERR_Pos                _UINT32_(6)                                          /* (FCW_INTENSET) NVMOP Error Interrupt Enable Bit Position */
#define FCW_INTENSET_OPERR_Msk                (_UINT32_(0x1) << FCW_INTENSET_OPERR_Pos)            /* (FCW_INTENSET) NVMOP Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_OPERR(value)             (FCW_INTENSET_OPERR_Msk & (_UINT32_(value) << FCW_INTENSET_OPERR_Pos)) /* Assigment of value for OPERR in the FCW_INTENSET register */
#define FCW_INTENSET_SECERR_Pos               _UINT32_(7)                                          /* (FCW_INTENSET) Security Violation Error Interrupt Enable Bit Position */
#define FCW_INTENSET_SECERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_SECERR_Pos)           /* (FCW_INTENSET) Security Violation Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_SECERR(value)            (FCW_INTENSET_SECERR_Msk & (_UINT32_(value) << FCW_INTENSET_SECERR_Pos)) /* Assigment of value for SECERR in the FCW_INTENSET register */
#define FCW_INTENSET_HTDPGM_Pos               _UINT32_(8)                                          /* (FCW_INTENSET) High Temperature Detect Error Interrupt Enable Bit Position */
#define FCW_INTENSET_HTDPGM_Msk               (_UINT32_(0x1) << FCW_INTENSET_HTDPGM_Pos)           /* (FCW_INTENSET) High Temperature Detect Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_HTDPGM(value)            (FCW_INTENSET_HTDPGM_Msk & (_UINT32_(value) << FCW_INTENSET_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the FCW_INTENSET register */
#define FCW_INTENSET_BORERR_Pos               _UINT32_(12)                                         /* (FCW_INTENSET) Brown Out Detect Error Interrupt Enable Bit Position */
#define FCW_INTENSET_BORERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_BORERR_Pos)           /* (FCW_INTENSET) Brown Out Detect Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_BORERR(value)            (FCW_INTENSET_BORERR_Msk & (_UINT32_(value) << FCW_INTENSET_BORERR_Pos)) /* Assigment of value for BORERR in the FCW_INTENSET register */
#define FCW_INTENSET_WRERR_Pos                _UINT32_(13)                                         /* (FCW_INTENSET) Write Error Interrupt Enable Bit Position */
#define FCW_INTENSET_WRERR_Msk                (_UINT32_(0x1) << FCW_INTENSET_WRERR_Pos)            /* (FCW_INTENSET) Write Error Interrupt Enable Bit Mask */
#define FCW_INTENSET_WRERR(value)             (FCW_INTENSET_WRERR_Msk & (_UINT32_(value) << FCW_INTENSET_WRERR_Pos)) /* Assigment of value for WRERR in the FCW_INTENSET register */
#define FCW_INTENSET_Msk                      _UINT32_(0x000031FF)                                 /* (FCW_INTENSET) Register Mask  */


/* -------- FCW_INTFLAG : (FCW Offset: 0x14) (R/W 32) NVM Interrupt Flag Register -------- */
#define FCW_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (FCW_INTFLAG) NVM Interrupt Flag Register  Reset Value */

